Microchip-MPLAB-Harmony/smartenergy_prime_apps/apps/prime_apps/prime_1_3_service_bin/src/packs/PIC32CX2051MTG128_DFP/component/aes.h
/* -------- AES_RPR : (AES Offset: 0x100) (R/W 32) Receive Pointer Register -------- */
#define AES_RPR_RXPTR_Pos                     _UINT32_(0)                                          /* (AES_RPR) Receive Pointer Register Position */
#define AES_RPR_RXPTR_Msk                     (_UINT32_(0xFFFFFFFF) << AES_RPR_RXPTR_Pos)          /* (AES_RPR) Receive Pointer Register Mask */
#define AES_RPR_RXPTR(value)                  (AES_RPR_RXPTR_Msk & (_UINT32_(value) << AES_RPR_RXPTR_Pos)) /* Assigment of value for RXPTR in the AES_RPR register */
#define AES_RPR_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (AES_RPR) Register Mask  */


/* -------- AES_RCR : (AES Offset: 0x104) (R/W 32) Receive Counter Register -------- */
#define AES_RCR_RXCTR_Pos                     _UINT32_(0)                                          /* (AES_RCR) Receive Counter Register Position */
#define AES_RCR_RXCTR_Msk                     (_UINT32_(0xFFFF) << AES_RCR_RXCTR_Pos)              /* (AES_RCR) Receive Counter Register Mask */
#define AES_RCR_RXCTR(value)                  (AES_RCR_RXCTR_Msk & (_UINT32_(value) << AES_RCR_RXCTR_Pos)) /* Assigment of value for RXCTR in the AES_RCR register */
#define AES_RCR_Msk                           _UINT32_(0x0000FFFF)                                 /* (AES_RCR) Register Mask  */


/* -------- AES_TPR : (AES Offset: 0x108) (R/W 32) Transmit Pointer Register -------- */
#define AES_TPR_TXPTR_Pos                     _UINT32_(0)                                          /* (AES_TPR) Transmit Counter Register Position */
#define AES_TPR_TXPTR_Msk                     (_UINT32_(0xFFFFFFFF) << AES_TPR_TXPTR_Pos)          /* (AES_TPR) Transmit Counter Register Mask */
#define AES_TPR_TXPTR(value)                  (AES_TPR_TXPTR_Msk & (_UINT32_(value) << AES_TPR_TXPTR_Pos)) /* Assigment of value for TXPTR in the AES_TPR register */
#define AES_TPR_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (AES_TPR) Register Mask  */


/* -------- AES_TCR : (AES Offset: 0x10C) (R/W 32) Transmit Counter Register -------- */
#define AES_TCR_TXCTR_Pos                     _UINT32_(0)                                          /* (AES_TCR) Transmit Counter Register Position */
#define AES_TCR_TXCTR_Msk                     (_UINT32_(0xFFFF) << AES_TCR_TXCTR_Pos)              /* (AES_TCR) Transmit Counter Register Mask */
#define AES_TCR_TXCTR(value)                  (AES_TCR_TXCTR_Msk & (_UINT32_(value) << AES_TCR_TXCTR_Pos)) /* Assigment of value for TXCTR in the AES_TCR register */
#define AES_TCR_Msk                           _UINT32_(0x0000FFFF)                                 /* (AES_TCR) Register Mask  */


/* -------- AES_RNPR : (AES Offset: 0x110) (R/W 32) Receive Next Pointer Register -------- */
#define AES_RNPR_RXNPTR_Pos                   _UINT32_(0)                                          /* (AES_RNPR) Receive Next Pointer Position */
#define AES_RNPR_RXNPTR_Msk                   (_UINT32_(0xFFFFFFFF) << AES_RNPR_RXNPTR_Pos)        /* (AES_RNPR) Receive Next Pointer Mask */
#define AES_RNPR_RXNPTR(value)                (AES_RNPR_RXNPTR_Msk & (_UINT32_(value) << AES_RNPR_RXNPTR_Pos)) /* Assigment of value for RXNPTR in the AES_RNPR register */
#define AES_RNPR_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (AES_RNPR) Register Mask  */


/* -------- AES_RNCR : (AES Offset: 0x114) (R/W 32) Receive Next Counter Register -------- */
#define AES_RNCR_RXNCTR_Pos                   _UINT32_(0)                                          /* (AES_RNCR) Receive Next Counter Position */
#define AES_RNCR_RXNCTR_Msk                   (_UINT32_(0xFFFF) << AES_RNCR_RXNCTR_Pos)            /* (AES_RNCR) Receive Next Counter Mask */
#define AES_RNCR_RXNCTR(value)                (AES_RNCR_RXNCTR_Msk & (_UINT32_(value) << AES_RNCR_RXNCTR_Pos)) /* Assigment of value for RXNCTR in the AES_RNCR register */
#define AES_RNCR_Msk                          _UINT32_(0x0000FFFF)                                 /* (AES_RNCR) Register Mask  */


/* -------- AES_TNPR : (AES Offset: 0x118) (R/W 32) Transmit Next Pointer Register -------- */
#define AES_TNPR_TXNPTR_Pos                   _UINT32_(0)                                          /* (AES_TNPR) Transmit Next Pointer Position */
#define AES_TNPR_TXNPTR_Msk                   (_UINT32_(0xFFFFFFFF) << AES_TNPR_TXNPTR_Pos)        /* (AES_TNPR) Transmit Next Pointer Mask */
#define AES_TNPR_TXNPTR(value)                (AES_TNPR_TXNPTR_Msk & (_UINT32_(value) << AES_TNPR_TXNPTR_Pos)) /* Assigment of value for TXNPTR in the AES_TNPR register */
#define AES_TNPR_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (AES_TNPR) Register Mask  */


/* -------- AES_TNCR : (AES Offset: 0x11C) (R/W 32) Transmit Next Counter Register -------- */
#define AES_TNCR_TXNCTR_Pos                   _UINT32_(0)                                          /* (AES_TNCR) Transmit Counter Next Position */
#define AES_TNCR_TXNCTR_Msk                   (_UINT32_(0xFFFF) << AES_TNCR_TXNCTR_Pos)            /* (AES_TNCR) Transmit Counter Next Mask */
#define AES_TNCR_TXNCTR(value)                (AES_TNCR_TXNCTR_Msk & (_UINT32_(value) << AES_TNCR_TXNCTR_Pos)) /* Assigment of value for TXNCTR in the AES_TNCR register */
#define AES_TNCR_Msk                          _UINT32_(0x0000FFFF)                                 /* (AES_TNCR) Register Mask  */


/* -------- AES_PTCR : (AES Offset: 0x120) ( /W 32) Transfer Control Register -------- */
#define AES_PTCR_RXTEN_Pos                    _UINT32_(0)                                          /* (AES_PTCR) Receiver Transfer Enable Position */
#define AES_PTCR_RXTEN_Msk                    (_UINT32_(0x1) << AES_PTCR_RXTEN_Pos)                /* (AES_PTCR) Receiver Transfer Enable Mask */
#define AES_PTCR_RXTEN(value)                 (AES_PTCR_RXTEN_Msk & (_UINT32_(value) << AES_PTCR_RXTEN_Pos)) /* Assigment of value for RXTEN in the AES_PTCR register */
#define AES_PTCR_RXTDIS_Pos                   _UINT32_(1)                                          /* (AES_PTCR) Receiver Transfer Disable Position */
#define AES_PTCR_RXTDIS_Msk                   (_UINT32_(0x1) << AES_PTCR_RXTDIS_Pos)               /* (AES_PTCR) Receiver Transfer Disable Mask */
#define AES_PTCR_RXTDIS(value)                (AES_PTCR_RXTDIS_Msk & (_UINT32_(value) << AES_PTCR_RXTDIS_Pos)) /* Assigment of value for RXTDIS in the AES_PTCR register */
#define AES_PTCR_TXTEN_Pos                    _UINT32_(8)                                          /* (AES_PTCR) Transmitter Transfer Enable Position */
#define AES_PTCR_TXTEN_Msk                    (_UINT32_(0x1) << AES_PTCR_TXTEN_Pos)                /* (AES_PTCR) Transmitter Transfer Enable Mask */
#define AES_PTCR_TXTEN(value)                 (AES_PTCR_TXTEN_Msk & (_UINT32_(value) << AES_PTCR_TXTEN_Pos)) /* Assigment of value for TXTEN in the AES_PTCR register */
#define AES_PTCR_TXTDIS_Pos                   _UINT32_(9)                                          /* (AES_PTCR) Transmitter Transfer Disable Position */
#define AES_PTCR_TXTDIS_Msk                   (_UINT32_(0x1) << AES_PTCR_TXTDIS_Pos)               /* (AES_PTCR) Transmitter Transfer Disable Mask */
#define AES_PTCR_TXTDIS(value)                (AES_PTCR_TXTDIS_Msk & (_UINT32_(value) << AES_PTCR_TXTDIS_Pos)) /* Assigment of value for TXTDIS in the AES_PTCR register */
#define AES_PTCR_RXCBEN_Pos                   _UINT32_(16)                                         /* (AES_PTCR) Receiver Circular Buffer Enable Position */
#define AES_PTCR_RXCBEN_Msk                   (_UINT32_(0x1) << AES_PTCR_RXCBEN_Pos)               /* (AES_PTCR) Receiver Circular Buffer Enable Mask */
#define AES_PTCR_RXCBEN(value)                (AES_PTCR_RXCBEN_Msk & (_UINT32_(value) << AES_PTCR_RXCBEN_Pos)) /* Assigment of value for RXCBEN in the AES_PTCR register */
#define AES_PTCR_RXCBDIS_Pos                  _UINT32_(17)                                         /* (AES_PTCR) Receiver Circular Buffer Disable Position */
#define AES_PTCR_RXCBDIS_Msk                  (_UINT32_(0x1) << AES_PTCR_RXCBDIS_Pos)              /* (AES_PTCR) Receiver Circular Buffer Disable Mask */
#define AES_PTCR_RXCBDIS(value)               (AES_PTCR_RXCBDIS_Msk & (_UINT32_(value) << AES_PTCR_RXCBDIS_Pos)) /* Assigment of value for RXCBDIS in the AES_PTCR register */
#define AES_PTCR_TXCBEN_Pos                   _UINT32_(18)                                         /* (AES_PTCR) Transmitter Circular Buffer Enable Position */
#define AES_PTCR_TXCBEN_Msk                   (_UINT32_(0x1) << AES_PTCR_TXCBEN_Pos)               /* (AES_PTCR) Transmitter Circular Buffer Enable Mask */
#define AES_PTCR_TXCBEN(value)                (AES_PTCR_TXCBEN_Msk & (_UINT32_(value) << AES_PTCR_TXCBEN_Pos)) /* Assigment of value for TXCBEN in the AES_PTCR register */
#define AES_PTCR_TXCBDIS_Pos                  _UINT32_(19)                                         /* (AES_PTCR) Transmitter Circular Buffer Disable Position */
#define AES_PTCR_TXCBDIS_Msk                  (_UINT32_(0x1) << AES_PTCR_TXCBDIS_Pos)              /* (AES_PTCR) Transmitter Circular Buffer Disable Mask */
#define AES_PTCR_TXCBDIS(value)               (AES_PTCR_TXCBDIS_Msk & (_UINT32_(value) << AES_PTCR_TXCBDIS_Pos)) /* Assigment of value for TXCBDIS in the AES_PTCR register */
#define AES_PTCR_ERRCLR_Pos                   _UINT32_(24)                                         /* (AES_PTCR) Transfer Bus Error Clear Position */
#define AES_PTCR_ERRCLR_Msk                   (_UINT32_(0x1) << AES_PTCR_ERRCLR_Pos)               /* (AES_PTCR) Transfer Bus Error Clear Mask */
#define AES_PTCR_ERRCLR(value)                (AES_PTCR_ERRCLR_Msk & (_UINT32_(value) << AES_PTCR_ERRCLR_Pos)) /* Assigment of value for ERRCLR in the AES_PTCR register */
#define AES_PTCR_Msk                          _UINT32_(0x010F0303)                                 /* (AES_PTCR) Register Mask  */


/* -------- AES_PTSR : (AES Offset: 0x124) ( R/ 32) Transfer Status Register -------- */
#define AES_PTSR_RXTEN_Pos                    _UINT32_(0)                                          /* (AES_PTSR) Receiver Transfer Enable Position */
#define AES_PTSR_RXTEN_Msk                    (_UINT32_(0x1) << AES_PTSR_RXTEN_Pos)                /* (AES_PTSR) Receiver Transfer Enable Mask */
#define AES_PTSR_RXTEN(value)                 (AES_PTSR_RXTEN_Msk & (_UINT32_(value) << AES_PTSR_RXTEN_Pos)) /* Assigment of value for RXTEN in the AES_PTSR register */
#define AES_PTSR_TXTEN_Pos                    _UINT32_(8)                                          /* (AES_PTSR) Transmitter Transfer Enable Position */
#define AES_PTSR_TXTEN_Msk                    (_UINT32_(0x1) << AES_PTSR_TXTEN_Pos)                /* (AES_PTSR) Transmitter Transfer Enable Mask */
#define AES_PTSR_TXTEN(value)                 (AES_PTSR_TXTEN_Msk & (_UINT32_(value) << AES_PTSR_TXTEN_Pos)) /* Assigment of value for TXTEN in the AES_PTSR register */
#define AES_PTSR_RXCBEN_Pos                   _UINT32_(16)                                         /* (AES_PTSR) Receiver Circular Buffer Enable Position */
#define AES_PTSR_RXCBEN_Msk                   (_UINT32_(0x1) << AES_PTSR_RXCBEN_Pos)               /* (AES_PTSR) Receiver Circular Buffer Enable Mask */
#define AES_PTSR_RXCBEN(value)                (AES_PTSR_RXCBEN_Msk & (_UINT32_(value) << AES_PTSR_RXCBEN_Pos)) /* Assigment of value for RXCBEN in the AES_PTSR register */
#define AES_PTSR_TXCBEN_Pos                   _UINT32_(18)                                         /* (AES_PTSR) Transmitter Circular Buffer Enable Position */
#define AES_PTSR_TXCBEN_Msk                   (_UINT32_(0x1) << AES_PTSR_TXCBEN_Pos)               /* (AES_PTSR) Transmitter Circular Buffer Enable Mask */
#define AES_PTSR_TXCBEN(value)                (AES_PTSR_TXCBEN_Msk & (_UINT32_(value) << AES_PTSR_TXCBEN_Pos)) /* Assigment of value for TXCBEN in the AES_PTSR register */
#define AES_PTSR_ERR_Pos                      _UINT32_(24)                                         /* (AES_PTSR) Transfer Bus Error Position */
#define AES_PTSR_ERR_Msk                      (_UINT32_(0x1) << AES_PTSR_ERR_Pos)                  /* (AES_PTSR) Transfer Bus Error Mask */
#define AES_PTSR_ERR(value)                   (AES_PTSR_ERR_Msk & (_UINT32_(value) << AES_PTSR_ERR_Pos)) /* Assigment of value for ERR in the AES_PTSR register */
#define AES_PTSR_Msk                          _UINT32_(0x01050101)                                 /* (AES_PTSR) Register Mask  */


/* -------- AES_PWPMR : (AES Offset: 0x128) (R/W 32) Write Protection Mode Register -------- */
#define AES_PWPMR_WPPTREN_Pos                 _UINT32_(0)                                          /* (AES_PWPMR) Write Protection Pointer Registers Enable Position */
#define AES_PWPMR_WPPTREN_Msk                 (_UINT32_(0x1) << AES_PWPMR_WPPTREN_Pos)             /* (AES_PWPMR) Write Protection Pointer Registers Enable Mask */
#define AES_PWPMR_WPPTREN(value)              (AES_PWPMR_WPPTREN_Msk & (_UINT32_(value) << AES_PWPMR_WPPTREN_Pos)) /* Assigment of value for WPPTREN in the AES_PWPMR register */
#define AES_PWPMR_WPCTREN_Pos                 _UINT32_(1)                                          /* (AES_PWPMR) Write Protection Counter Registers Enable Position */
#define AES_PWPMR_WPCTREN_Msk                 (_UINT32_(0x1) << AES_PWPMR_WPCTREN_Pos)             /* (AES_PWPMR) Write Protection Counter Registers Enable Mask */
#define AES_PWPMR_WPCTREN(value)              (AES_PWPMR_WPCTREN_Msk & (_UINT32_(value) << AES_PWPMR_WPCTREN_Pos)) /* Assigment of value for WPCTREN in the AES_PWPMR register */
#define AES_PWPMR_WPCREN_Pos                  _UINT32_(2)                                          /* (AES_PWPMR) Write Protection Control Register Enable Position */
#define AES_PWPMR_WPCREN_Msk                  (_UINT32_(0x1) << AES_PWPMR_WPCREN_Pos)              /* (AES_PWPMR) Write Protection Control Register Enable Mask */
#define AES_PWPMR_WPCREN(value)               (AES_PWPMR_WPCREN_Msk & (_UINT32_(value) << AES_PWPMR_WPCREN_Pos)) /* Assigment of value for WPCREN in the AES_PWPMR register */
#define AES_PWPMR_WPKEY_Pos                   _UINT32_(8)                                          /* (AES_PWPMR) Write Protection Key Position */
#define AES_PWPMR_WPKEY_Msk                   (_UINT32_(0xFFFFFF) << AES_PWPMR_WPKEY_Pos)          /* (AES_PWPMR) Write Protection Key Mask */
#define AES_PWPMR_WPKEY(value)                (AES_PWPMR_WPKEY_Msk & (_UINT32_(value) << AES_PWPMR_WPKEY_Pos)) /* Assigment of value for WPKEY in the AES_PWPMR register */
#define   AES_PWPMR_WPKEY_PASSWD_Val          _UINT32_(0x504443)                                   /* (AES_PWPMR) Writing any other value in this field aborts the write operation. Always reads as 0.  */
#define AES_PWPMR_WPKEY_PASSWD                (AES_PWPMR_WPKEY_PASSWD_Val << AES_PWPMR_WPKEY_Pos)  /* (AES_PWPMR) Writing any other value in this field aborts the write operation. Always reads as 0. Position  */
#define AES_PWPMR_Msk                         _UINT32_(0xFFFFFF07)                                 /* (AES_PWPMR) Register Mask  */


/** \brief AES register offsets definitions */
#define AES_CR_REG_OFST                _UINT32_(0x00)      /* (AES_CR) Control Register Offset */
#define AES_MR_REG_OFST                _UINT32_(0x04)      /* (AES_MR) Mode Register Offset */
#define AES_IER_REG_OFST               _UINT32_(0x10)      /* (AES_IER) Interrupt Enable Register Offset */
#define AES_IDR_REG_OFST               _UINT32_(0x14)      /* (AES_IDR) Interrupt Disable Register Offset */
#define AES_IMR_REG_OFST               _UINT32_(0x18)      /* (AES_IMR) Interrupt Mask Register Offset */
#define AES_ISR_REG_OFST               _UINT32_(0x1C)      /* (AES_ISR) Interrupt Status Register Offset */
#define AES_KEYWR_REG_OFST             _UINT32_(0x20)      /* (AES_KEYWR) Key Word Register Offset */
#define AES_KEYWR0_REG_OFST            _UINT32_(0x20)      /* (AES_KEYWR0) Key Word Register Offset */
#define AES_KEYWR1_REG_OFST            _UINT32_(0x24)      /* (AES_KEYWR1) Key Word Register Offset */
#define AES_KEYWR2_REG_OFST            _UINT32_(0x28)      /* (AES_KEYWR2) Key Word Register Offset */
#define AES_KEYWR3_REG_OFST            _UINT32_(0x2C)      /* (AES_KEYWR3) Key Word Register Offset */
#define AES_KEYWR4_REG_OFST            _UINT32_(0x30)      /* (AES_KEYWR4) Key Word Register Offset */
#define AES_KEYWR5_REG_OFST            _UINT32_(0x34)      /* (AES_KEYWR5) Key Word Register Offset */
#define AES_KEYWR6_REG_OFST            _UINT32_(0x38)      /* (AES_KEYWR6) Key Word Register Offset */
#define AES_KEYWR7_REG_OFST            _UINT32_(0x3C)      /* (AES_KEYWR7) Key Word Register Offset */
#define AES_IDATAR_REG_OFST            _UINT32_(0x40)      /* (AES_IDATAR) Input Data Register Offset */
#define AES_IDATAR0_REG_OFST           _UINT32_(0x40)      /* (AES_IDATAR0) Input Data Register Offset */
#define AES_IDATAR1_REG_OFST           _UINT32_(0x44)      /* (AES_IDATAR1) Input Data Register Offset */
#define AES_IDATAR2_REG_OFST           _UINT32_(0x48)      /* (AES_IDATAR2) Input Data Register Offset */
#define AES_IDATAR3_REG_OFST           _UINT32_(0x4C)      /* (AES_IDATAR3) Input Data Register Offset */
#define AES_ODATAR_REG_OFST            _UINT32_(0x50)      /* (AES_ODATAR) Output Data Register Offset */
#define AES_ODATAR0_REG_OFST           _UINT32_(0x50)      /* (AES_ODATAR0) Output Data Register Offset */
#define AES_ODATAR1_REG_OFST           _UINT32_(0x54)      /* (AES_ODATAR1) Output Data Register Offset */
#define AES_ODATAR2_REG_OFST           _UINT32_(0x58)      /* (AES_ODATAR2) Output Data Register Offset */
#define AES_ODATAR3_REG_OFST           _UINT32_(0x5C)      /* (AES_ODATAR3) Output Data Register Offset */
#define AES_IVR_REG_OFST               _UINT32_(0x60)      /* (AES_IVR) Initialization Vector Register Offset */
#define AES_IVR0_REG_OFST              _UINT32_(0x60)      /* (AES_IVR0) Initialization Vector Register Offset */
#define AES_IVR1_REG_OFST              _UINT32_(0x64)      /* (AES_IVR1) Initialization Vector Register Offset */
#define AES_IVR2_REG_OFST              _UINT32_(0x68)      /* (AES_IVR2) Initialization Vector Register Offset */
#define AES_IVR3_REG_OFST              _UINT32_(0x6C)      /* (AES_IVR3) Initialization Vector Register Offset */
#define AES_AADLENR_REG_OFST           _UINT32_(0x70)      /* (AES_AADLENR) Additional Authenticated Data Length Register Offset */
#define AES_CLENR_REG_OFST             _UINT32_(0x74)      /* (AES_CLENR) Plaintext/Ciphertext Length Register Offset */
#define AES_GHASHR_REG_OFST            _UINT32_(0x78)      /* (AES_GHASHR) GCM Intermediate Hash Word Register Offset */
#define AES_GHASHR0_REG_OFST           _UINT32_(0x78)      /* (AES_GHASHR0) GCM Intermediate Hash Word Register Offset */
#define AES_GHASHR1_REG_OFST           _UINT32_(0x7C)      /* (AES_GHASHR1) GCM Intermediate Hash Word Register Offset */
#define AES_GHASHR2_REG_OFST           _UINT32_(0x80)      /* (AES_GHASHR2) GCM Intermediate Hash Word Register Offset */
#define AES_GHASHR3_REG_OFST           _UINT32_(0x84)      /* (AES_GHASHR3) GCM Intermediate Hash Word Register Offset */
#define AES_TAGR_REG_OFST              _UINT32_(0x88)      /* (AES_TAGR) GCM Authentication Tag Word Register Offset */
#define AES_TAGR0_REG_OFST             _UINT32_(0x88)      /* (AES_TAGR0) GCM Authentication Tag Word Register Offset */
#define AES_TAGR1_REG_OFST             _UINT32_(0x8C)      /* (AES_TAGR1) GCM Authentication Tag Word Register Offset */
#define AES_TAGR2_REG_OFST             _UINT32_(0x90)      /* (AES_TAGR2) GCM Authentication Tag Word Register Offset */
#define AES_TAGR3_REG_OFST             _UINT32_(0x94)      /* (AES_TAGR3) GCM Authentication Tag Word Register Offset */
#define AES_CTRR_REG_OFST              _UINT32_(0x98)      /* (AES_CTRR) GCM Encryption Counter Value Register Offset */
#define AES_GCMHR_REG_OFST             _UINT32_(0x9C)      /* (AES_GCMHR) GCM H Word Register Offset */
#define AES_GCMHR0_REG_OFST            _UINT32_(0x9C)      /* (AES_GCMHR0) GCM H Word Register Offset */
#define AES_GCMHR1_REG_OFST            _UINT32_(0xA0)      /* (AES_GCMHR1) GCM H Word Register Offset */
#define AES_GCMHR2_REG_OFST            _UINT32_(0xA4)      /* (AES_GCMHR2) GCM H Word Register Offset */
#define AES_GCMHR3_REG_OFST            _UINT32_(0xA8)      /* (AES_GCMHR3) GCM H Word Register Offset */
#define AES_EMR_REG_OFST               _UINT32_(0xB0)      /* (AES_EMR) Extended Mode Register Offset */
#define AES_BCNT_REG_OFST              _UINT32_(0xB4)      /* (AES_BCNT) Byte Counter Register Offset */
#define AES_WPMR_REG_OFST              _UINT32_(0xE4)      /* (AES_WPMR) Write Protection Mode Register Offset */
#define AES_WPSR_REG_OFST              _UINT32_(0xE8)      /* (AES_WPSR) Write Protection Status Register Offset */
#define AES_RPR_REG_OFST               _UINT32_(0x100)     /* (AES_RPR) Receive Pointer Register Offset */
#define AES_RCR_REG_OFST               _UINT32_(0x104)     /* (AES_RCR) Receive Counter Register Offset */
#define AES_TPR_REG_OFST               _UINT32_(0x108)     /* (AES_TPR) Transmit Pointer Register Offset */
#define AES_TCR_REG_OFST               _UINT32_(0x10C)     /* (AES_TCR) Transmit Counter Register Offset */
#define AES_RNPR_REG_OFST              _UINT32_(0x110)     /* (AES_RNPR) Receive Next Pointer Register Offset */
#define AES_RNCR_REG_OFST              _UINT32_(0x114)     /* (AES_RNCR) Receive Next Counter Register Offset */
#define AES_TNPR_REG_OFST              _UINT32_(0x118)     /* (AES_TNPR) Transmit Next Pointer Register Offset */
#define AES_TNCR_REG_OFST              _UINT32_(0x11C)     /* (AES_TNCR) Transmit Next Counter Register Offset */
#define AES_PTCR_REG_OFST              _UINT32_(0x120)     /* (AES_PTCR) Transfer Control Register Offset */
#define AES_PTSR_REG_OFST              _UINT32_(0x124)     /* (AES_PTSR) Transfer Status Register Offset */
#define AES_PWPMR_REG_OFST             _UINT32_(0x128)     /* (AES_PWPMR) Write Protection Mode Register Offset */

